#pragma once

constexpr int NumMeshes = 3;

unsigned NumVertexElements = 8;
constexpr float N = 0.577350259f;//角から斜め４５度に伸びる法線を設定するための値
float Vertices[NumMeshes][64] = 
{
	//Pos					Normal     TexCoord
	-0.50f, -0.12f, -0.60f,	-N,-N,-N,  0.0f, 0.0f,
	-0.50f, -0.12f,  0.60f, -N,-N, N,  0.0f, 0.0f,
	-0.50f,  0.12f,  0.60f, -N, N, N,  0.0f, 0.0f,
	-0.50f,  0.12f, -0.60f, -N, N,-N,  0.0f, 0.0f,
	 0.50f, -0.12f, -0.60f,  N,-N,-N,  0.0f, 0.0f,
	 0.50f, -0.12f,  0.60f,  N,-N, N,  0.0f, 0.0f,
	 0.50f,  0.12f,  0.60f,  N, N, N,  0.0f, 0.0f,
	 0.50f,  0.12f, -0.60f,  N, N,-N,  0.0f, 0.0f,

	-0.26f, -0.12f, -0.30f,	-N,-N,-N,  0.0f, 0.0f,
	-0.26f, -0.12f,  0.30f,	-N,-N, N,  0.0f, 0.0f,
	-0.26f,  0.13f,  0.30f, -N, N, N,  0.0f, 0.0f,
	-0.26f,  0.13f, -0.30f,	-N, N,-N,  0.0f, 0.0f,
	 0.26f, -0.12f, -0.30f,	 N,-N,-N,  0.0f, 0.0f,
	 0.26f, -0.12f,  0.30f,	 N,-N, N,  0.0f, 0.0f,
	 0.26f,  0.13f,  0.30f,	 N, N, N,  0.0f, 0.0f,
	 0.26f,  0.13f, -0.30f,	 N, N,-N,  0.0f, 0.0f,

	-0.04f, -0.04f,  0.00f,	-N,-N, N,  0.0f, 0.0f,
	-0.04f, -0.04f, -0.80f,	-N,-N,-N,  0.0f, 0.0f,
	-0.04f,  0.04f, -0.80f,	-N, N,-N,  0.0f, 0.0f,
	-0.04f,  0.04f,  0.00f,	-N, N, N,  0.0f, 0.0f,
	 0.04f, -0.04f,  0.00f,	 N,-N, N,  0.0f, 0.0f,
	 0.04f, -0.04f, -0.80f,	 N,-N,-N,  0.0f, 0.0f,
	 0.04f,  0.04f, -0.80f,	 N, N,-N,  0.0f, 0.0f,
	 0.04f,  0.04f, -0.00f,	 N, N,-N,  0.0f, 0.0f,
};

unsigned short Indices[NumMeshes][36] = 
{
	2,1,0,
	2,0,3,
	7,4,5,
	7,5,6,
	3,0,4,
	3,4,7,
	6,5,1,
	6,1,2,
	2,3,7,
	2,7,6,
	0,1,5,
	0,5,4,

	2,1,0,
	2,0,3,
	7,4,5,
	7,5,6,
	3,0,4,
	3,4,7,
	6,5,1,
	6,1,2,
	2,3,7,
	2,7,6,
	0,1,5,
	0,5,4,

	1,2,0,
	0,2,3,
	4,7,5,
	5,7,6,
	0,3,4,
	4,3,7,
	5,6,1,
	1,6,2,
	3,2,7,
	7,2,6,
	1,0,5,
	5,0,4,
};

float Ambient[NumMeshes][4] = 
{
	0.2f, 0.0f, 0.0f, 0.0f,
	0.0f, 0.2f, 0.0f, 0.0f,
	0.2f, 0.2f, 0.0f, 0.0f,
};
float Diffuse[NumMeshes][4] =
{
	0.8f, 0.0f, 0.0f, 1.0f,
	0.0f, 0.8f, 0.0f, 1.0f,
	0.8f, 0.8f, 0.0f, 1.0f,
};

const char* TextureFilename = "assets\\white.png";

//階層メッシュデータ
//　親のインデックス
int ParentIdx[3] =
{
	-1,//0 本体(-1はルート)
	 0,//1 砲台
	 1,//2 砲
};

//　親からの相対姿勢行列
XMMATRIX BindWorld[NumMeshes] =
{
	{1,0,0,0, 0,1,0,0, 0,0,1,0,  0, 0.12f, 0.0f, 1},//0
	{1,0,0,0, 0,1,0,0, 0,0,1,0,  0, 0.24f, 0.1f, 1},//1
	{1,0,0,0, 0,1,0,0, 0,0,1,0,  0, 0.00f,-0.3f, 1},//2
};

//アニメーションデータ
//  キーフレーム数
constexpr int NumKeyframes = 3;
//　次のキーまでの間隔
int Interval = 120;
//　砲台の回転行列用
float r1 = 90 * 3.1415926f / 180;
float c1 = cosf(r1);
float s1 = sinf(r1);
//　砲の回転行列用
float r2 = 20 * 3.1415926f / 180;
float c2 = cosf(r2);
float s2 = sinf(r2);
//  キーフレーム行列
XMMATRIX KeyframeWorlds[NumKeyframes][NumMeshes] =
{
	//キーフレーム０
	{
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1},//0
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1},//1
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1}//2
	},
	//キーフレーム１
	{
		{1,0,0,0,   0,1,0,0,  0,0,1,0,   0,0,-1,1},//0 移動
		{c1,0,-s1,0,  0,1,0,0,  s1,0,c1,0,   0,0,0,1},//1 Y軸回転
		{1,0,0,0,   0,c2,s2,0,  0,-s2,c2,0,  0,0,0,1}//2 X軸回転
	},
	//キーフレーム２
	{
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1},//0
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1},//1
		{1,0,0,0, 0,1,0,0, 0,0,1,0, 0,0,0,1}//2
	}
};
